# 문항1: 다음 중 Python 언어의 특징이 아닌 것은 무엇인가요?
# 1) 간결하고 읽기 쉬운 문법
# 2) 객체 지향적 프로그래밍 지원
# 3) 메모리 관리가 수동적으로 이루어짐
# 4) 동적 타이핑 지원
# 5) 광범위한 표준 라이브러리 제공

# 문항2: HTML에서 웹페이지의 제목을 설정하는 태그는 무엇인가요?
# 1)<head> 2)<title> 3)<h1> 4)<body> 5)<p>

# 문항3 : 다음 중 Java 언어에서 'final' 키워드의 역할로 틀린 것은 무엇인가요?
# 1) 변수: 한번 초기화하면 값 변경 불가
# 2) 메소드: 오버라이딩(재정의) 불가
# 3) 클래스: 상속 불가
# 4) 배열: 배열의 크기 변경 불가
# 5) 모든 위의 사항들

# 문항4: SQL에서 테이블의 데이터를 조회하는 명령어는 무엇인가요?
# 1) INSERT2) UPDATE3) DELETE4) SELECT5) CREATE

# 문항5: 다음 중 JavaScript에서 비동기 처리를 위한 객체는 무엇인가요?
# 1) Callback2) Promise3) Async/Await4) jQuery5) 모든 위의 사항들

# 정답 : 3 2 4 4 5

# 배점 : 20 30 15 20 15(점)


#####################################################################################################

# 문제 유형을 입력하세요 (4지 선다형): 4지 선다형
# 문항 수를 입력하세요 (5문항): 5

# 문제와 선택지를 입력하세요:
#   문항1: Python의 창시자는 누구인가? 
# 선택지: 1. Guido van Rossum 2. James Gosling 3. Dennis Ritchie 4. Brendan Eich
# 점수 : 10
# 정답 : 1
#   문항2: Python에서 리스트의 길이를 반환하는 내장 함수는? 
# 선택지: 1. sum 2. len 3. list 4. Str
# 점수 : 30
# 정답 : 2
#   ...
# —----------------------------------------------------
# 응시자 이름을 입력하세요: 홍길동
# 문제를 풀어주세요: 
#   문항1: Python의 창시자는 누구인가? / 선택지: 1. Guido van Rossum 2. James Gosling 3. Dennis Ritchie 4. Brendan Eich
#   답: 1
#   ...
# 다음 응시자가 있나요? (계속: c, 종료: x): c

# 응시자 이름을 입력하세요: 홍길동
# 문제를 풀어주세요: 
#   문항1: Python의 창시자는 누구인가? / 선택지: 1. Guido van Rossum 2. James Gosling 3. Dennis Ritchie 4. Brendan Eich
#   답: 3
#   …  
# 다음 응시자가 있나요? (계속: c, 종료: x): x
# —--------------------------------------------------
# 각 문항 정답  (예: 1, 2, 3, 4, 1): 1, 2, 3, 4, 1


# 응시자별 채점 결과:
#   홍길동: 95점
#   이순신: 85점
#   ...
# 과목 평균 점수: 90점
